IOsonata/IOsonata/ARM/Nordic/nRF91/src/shared_irq_nrf91.cpp
/**-------------------------------------------------------------------------
@file	shared_irq_nrf91.cpp

@brief	Shared IRQ handler

@author	Nguyen Hoan Hoang
@date	Mar. 12, 2020

@lincense

MIT License

Copyright (c) 2020 I-SYST inc. All rights reserved.

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#include <string.h>

#include "nrf.h"

#include "device_intrf.h"
#include "shared_irq_nrf91.h"

#pragma pack(push, 4)
typedef struct {
	DEVINTRF *pDev;				// Device interface data
	IRQHANDLER Handler ;		// Device interface interrupt handler
} IRQDATA;
#pragma pack(pop)

#define MAX_NB_DEV		4

static IRQDATA s_DevIrq[MAX_NB_DEV] = { {NULL, }, };

void SetSharedIntHandler(int DevNo, DEVINTRF *pDev, IRQHANDLER Handler)
{
	if (DevNo < 0 || DevNo >= MAX_NB_DEV)
	{
		return;
	}

	s_DevIrq[DevNo].pDev = pDev;
	s_DevIrq[DevNo].Handler = Handler;
}

extern "C" void UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_IRQHandler(void)
{
	if (s_DevIrq[0].pDev != NULL)
	{
		s_DevIrq[0].Handler(0, s_DevIrq[0].pDev);
	}
	NVIC_ClearPendingIRQ(UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_IRQn);
}

extern "C" void UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_IRQHandler(void)
{
	if (s_DevIrq[1].pDev != NULL)
	{
		s_DevIrq[1].Handler(1, s_DevIrq[1].pDev);
	}
	NVIC_ClearPendingIRQ(UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_IRQn);
}

extern "C" void UARTE2_SPIM2_SPIS2_TWIM2_TWIS2_IRQHandler(void)
{
    if (s_DevIrq[2].pDev != NULL)
    {
        s_DevIrq[2].Handler(2, s_DevIrq[2].pDev);
    }
    NVIC_ClearPendingIRQ(UARTE2_SPIM2_SPIS2_TWIM2_TWIS2_IRQn);
}

extern "C" void UARTE3_SPIM3_SPIS3_TWIM3_TWIS3_IRQHandler(void)
{
    if (s_DevIrq[3].pDev != NULL)
    {
        s_DevIrq[3].Handler(3, s_DevIrq[3].pDev);
    }
    NVIC_ClearPendingIRQ(UARTE3_SPIM3_SPIS3_TWIM3_TWIS3_IRQn);
}

